---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurveFailures.CannotFindAreaScheme
source: html/cc5bf305-acf7-d5f8-f28f-b15db1dc73c7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurveFailures.CannotFindAreaScheme Property

Can't find new Area Scheme for Area Boundary.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotFindAreaScheme { get; }
```